Revit 2027 API
Duct.DuctType Property
 The duct type of this duct.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctType DuctType { get; set; }
Public Property DuctType As DuctType
	Get
	Set
public:
property DuctType^ DuctType {
	DuctType^ get ();
	void set (DuctType^ value);
}
member DuctType : DuctType with get, set
Property Value
DuctType
See Also
Reference
Duct Class
Autodesk.Revit.DB.Mechanical Namespace